run/hartmann/hartmannMHD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       127440;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       127600;
    }
    lowerWall
    {
        type            patch;
        nFaces          400;
        startFace       127760;
    }
    upperWall
    {
        type            patch;
        nFaces          400;
        startFace       128160;
    }
    frontAndBack
    {
        type            empty;
        nFaces          128000;
        startFace       128560;
    }
)


// ************************************************************************* //
